src/Catalogs/ЗД_ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗД_ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортАгентаСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРазрешения</Name>
					<Comment>При установленной блокировки в 1Сv8*</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВременныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжиданияОтключения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКПлатформе1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезапускКластера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключенияБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКRAC</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеглЗаданияИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеглЗаданияАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скрипт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗД_Скрипты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Хранилище</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗД_Хранилища</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛогинХранилища</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольХранилища</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЗД_ИнформационныеБазы/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	//Наименование = ИмяБазы + ?(ПортКластера = "","",":"+ПортКластера);
	//Если Не ПустаяСтрока(КаталогВременныхФайлов) Тогда
	//	Если Прав(КаталогВременныхФайлов,1)<>"\" Тогда
	//		КаталогВременныхФайлов = КаталогВременныхФайлов+"\";
	//	КонецЕсли;
	//КонецЕсли;   
	УстановитьСостояниеРЗ(Отказ);
	
КонецПроцедуры




Процедура УстановитьСостояниеРЗ(Отказ)
	Перем НастройкиРЗ;
	
	ПустойУИД = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"); 
	ДополнительныеСвойства.Свойство("НастройкиРЗ", НастройкиРЗ);
	
	Если РеглЗаданияАктивность   Тогда
		
		СсылкаОбъекта = Ссылка;
		Если ЭтоНовый() Тогда
			СсылкаОбъекта = ПолучитьСсылкуНового();
			Если НЕ ЗначениеЗаполнено(СсылкаОбъекта) Тогда
				СсылкаОбъекта = Справочники.ЗД_ИнформационныеБазы.ПолучитьСсылку();
				УстановитьСсылкуНового(СсылкаОбъекта);
			КонецЕсли;
		КонецЕсли; 
		
		НаименованиеРЗ = "Скрипт ИБ:"+Наименование;
		Если РеглЗаданияИдентификатор = ПустойУИД Тогда
			РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("ВыполнениеСкриптов");			
		Иначе
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданияИдентификатор);
			Если РЗ = Неопределено Тогда
				РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("ВыполнениеСкриптов");
			КонецЕсли;
		КонецЕсли;
				
		РЗ.Расписание = НастройкиРЗ;
		РЗ.Наименование = НаименованиеРЗ;
		РЗ.Использование = Истина;
		РЗ.Параметры.Очистить();
		РЗ.Параметры.Добавить(СсылкаОбъекта);
		РЗ.Записать();
		
		РеглЗаданияИдентификатор = РЗ.УникальныйИдентификатор;
		
	Иначе
		Если РеглЗаданияИдентификатор <> ПустойУИД Тогда
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданияИдентификатор);
			Если РЗ <> Неопределено Тогда
				РЗ.Удалить();
			КонецЕсли;
			РеглЗаданияИдентификатор = ПустойУИД;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
